ThinhCSE-HCMUT/Logic-Design-Project/STM32F103C8T6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define led_Pin GPIO_PIN_13
#define led_GPIO_Port GPIOC
#define R1_Pin GPIO_PIN_0
#define R1_GPIO_Port GPIOA
#define R2_Pin GPIO_PIN_1
#define R2_GPIO_Port GPIOA
#define R3_Pin GPIO_PIN_2
#define R3_GPIO_Port GPIOA
#define R4_Pin GPIO_PIN_3
#define R4_GPIO_Port GPIOA
#define SSCS_RFID_Pin GPIO_PIN_4
#define SSCS_RFID_GPIO_Port GPIOA
#define SCLK_RFID_Pin GPIO_PIN_5
#define SCLK_RFID_GPIO_Port GPIOA
#define MISO_RFID_Pin GPIO_PIN_6
#define MISO_RFID_GPIO_Port GPIOA
#define MOSI_RFID_Pin GPIO_PIN_7
#define MOSI_RFID_GPIO_Port GPIOA
#define BUZZER_Pin GPIO_PIN_11
#define BUZZER_GPIO_Port GPIOB
#define C1_Pin GPIO_PIN_12
#define C1_GPIO_Port GPIOB
#define C2_Pin GPIO_PIN_13
#define C2_GPIO_Port GPIOB
#define C3_Pin GPIO_PIN_14
#define C3_GPIO_Port GPIOB
#define C4_Pin GPIO_PIN_15
#define C4_GPIO_Port GPIOB
#define TX_WIFI_Pin GPIO_PIN_6
#define TX_WIFI_GPIO_Port GPIOB
#define RX_WIFI_Pin GPIO_PIN_7
#define RX_WIFI_GPIO_Port GPIOB
#define SCL_LCD_Pin GPIO_PIN_8
#define SCL_LCD_GPIO_Port GPIOB
#define SDA_LCD_Pin GPIO_PIN_9
#define SDA_LCD_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
